testCases/final_version/mykkLOmega/0/p
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 8.5e4;

boundaryField
{
    wall      
    {
        type            zeroGradient;
    }

    outlet
    {
		type            fixedValue;
        value           uniform 8.5e4;
    }

    inlet
    { 
        type    zeroGradient;
    }

    firstBottomFace      
    {
        type            zeroGradient;
    }

    firstTopFace      
    {
        type            zeroGradient;
    }
    
    secondTopFace      
    {
        type            zeroGradient;
    }
        
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
